<template>
    <div class="blog mt-4 mb-3">
        <b-container>
            <b-row style="direction: rtl" class="text-right">
                <b-col lg="9" class="border">
                    <h1 class="title text-center text-color1">{{subject.title}}</h1>
                    <div class="info">
                        <div class="source">المصدر: {{subject.source}}</div>
                        <div class="date">
                            تم النشر يوم: {{subject.date}}
                        </div>
                    </div>
                    <div class="my-2 mx-auto w-fit">
                        <img :src="require(`../../subjects/sections/${subject.section}/${subject.title}.jpeg`)" alt="post-image">
                    </div>
        <div class="content">
            <h5>محتويات الصفحة</h5>
            <ul class="list-group list_content">
                <div class="row w-100">
                    <div class="col-md-6 list-group-item">
                        <li class=""><a class="text-dark" href="#chpress_intro">مقدمة</a></li>
                    </div>
                    <div class="col-md-6 list-group-item">
                        <li class=""><a class="text-dark" href="#chpress_cure">العلاج</a></li>
                    </div>
                    <div class="col-md-6 list-group-item">
                        <li class=""><a class="text-dark" href="#chpress_symp">الأعراض</a></li>
                    </div>
                    <div class="col-md-6 list-group-item">
                        <li class=""><a class="text-dark" href="#chpress_danger">عوامل الخطر لارتفاع ضغط الدم</a></li>
                    </div>
                </div>
            </ul>
            <h5>مقدمة</h5>
            <p class="intro">{{subject.head}}</p>
            
            <h5>كيف يؤثر ارتفاع ضغط الدم على الأطفال؟</h5>
            <p>مثلما يحدث مع البالغين، يمكن أن يؤدي ارتفاع ضغط الدم لدى الأطفال إلى مشاكل صحية خطيرة وطويلة المدى، حيث يزداد خطر الإصابة بأمراض القلب والأوعية الدموية. </p>
            <h5 id="chpress_symp">أعراض ارتفاع ضغط الدم عند الأطفال</h5>
            <div>
                في أغلب الأحيان، لا تظهر أي أعراض على الأطفال المصابين بارتفاع ضغط الدم خلال المراحل الأولى، ولكن في حالة الوصول للمرحلة الثانية من المرض، فقد يعاني الطفل من واحد أو أكثر من الأعراض التالية:
                <ul>
                    <li>الصداع</li>
                    <li>ضعف البصر</li>
                    <li>الرؤية المزدوجة</li>
                    <li>ألم في الصدر</li>
                    <li>وجع البطن</li>
                    <li>مشاكل في التنفس</li>
                </ul>
                <p>
                    كما يمكن أن يكون الطفل المصاب بارتفاع ضغط الدم في المرحلة الثانية سريع الإنفعال، ولا يتغذى بشكل جيد، كما يمكن أن يصاب بالتقيؤ، وفي حالة إصابة الرضيع به، فقد يعاني من مشاكل النمو. 
                </p>
            </div>
            <h5 id="chpress_danger">عوامل الخطر لارتفاع ضغط الدم لدى الأطفال</h5>
            <p>
                هناك بعض العوامل التي تزيد فرص إصابة الطفل بارتفاع ضغط الدم مثل السمنة والتاريخ العائلي لهذا المرض، بالإضافة إلى بعض المشاكل الصحية مثل توقف التنفس أثناء النوم (Sleep apnea) واضطرابات النوم الأخرى.
            </p>
            <h5>مدى انتشار ضغط الدم عند الأطفال</h5>
            <p>أصبح ارتفاع ضغط الدم شائعًا بشكل متزايد لدى الأطفال والمراهقين. ويصعب اكتشاف ضغط الدم عند الأطفال بسهولة للأسباب التالية:</p>
            <ul>
                <li>صعوبة قياسه عند الرضع والأطفال الصغار</li>
                <li>يصعب التعرف عليه في بعض الأحيان</li>
                <li>يعتقد الوالدان أن شيء اخر هو الذي يؤثر على الطفل ويستبعدوا ارتفاع ضغط الدم</li>
                <li>قد يكون من الصعب قياسه عند الرضع والأطفال الصغار</li>
            </ul>
            <h5>فحص ارتفاع ضغط الدم عند الأطفال</h5>
            <p>
                يصعب تشخيص ارتفاع ضغط الدم لدى الأطفال، حيث يمكن أن يتأثر ضغط الدم بعدة عوامل، مثل الطول والعمر والجنس، وغالبًا لا توجد أعراض، وقد يختلف ضغط الدم من يوم لاخر.
                في حالة اكتشاف ارتفاع ضغط الدم لدى الطفل، فسوف يطلب الطبيب أن يعيد قياسه مرة أخرى بعد مرور أسبوع للتأكد من استمرار القراءة المرتفعة أو عودتها للمعدلات الطبيعية.
                وإذا كان الطفل يعاني من قراءات مرتفعة خلال ثلاث زيارات متتالية، فسوف يقوم الطبيب بإجراء تقييم لسبب هذا الإرتفاع ويصف العلاجات المناسب لتفادي المضاعفات.
                وبشكل عام، ينصح بإجراء فحوصات ضغط الدم للأطفال بشكل سنوي، وذلك بدءًا من سن الثالثة.
            </p>
            <h5 id="chpress_cure">علاج ارتفاع ضغط الدم عند الأطفال</h5>
            <div>
                يعتمد علاج ارتفاع ضغط الدم عند الأطفال على سببه، فمثلًا إذا أصيب الطفل بارتفاع ضغط الدم الناتج عن بعض الأمراض مثل أمراض الكلى أو أمراض الرئة، فيجب علاج هذه الأمراض أولًا لإعادة ضغط الدم إلى طبيعته. وقد يوصي الأطباء بإجراء تغيرات في نمط حياة الأطفال المصابين بارتفاع ضغط الدم، وتشمل:
                <ul>
                    <li>تناول نظام غذائي صحي: يجب أن يتناول الطفل الخضروات والفواكه ومنتجات الألبان قليلة الدسم.</li>
                    <li>وفي المقابل، ينبغي تقليل الملح وتجنب تناول المشروبات الغنية بالكافيين مثل الشاي والقهوة والمشروبات الغازية</li>
                    <li>ممارسة الرياضة بانتظام: تساعد ممارسة الرياضة بانتظام 3 مرات على الأقل في الأسبوع، ولكن لا يجب على الأطفال الذين يعانون من ارتفاع ضغط الدم الشديد القيام بمجهود شديد في ممارسة الرياضة</li>
                    <li>إذا لم تساعد التغييرات في النظام الغذائي وممارسة الرياضة في تحسين ضغط الدم، فقد يصف الأطباء أدوية ارتفاع ضغط الدم</li>
                </ul>
            </div>
        </div>
    </b-col>
                <b-col lg="3">
                    <b-card class="mt-1 mb-5 text-center" title="" header="مواضيع ذات صلة">
                        <div v-for="item in this.$store.getters.kids" :key="item.id">
                            <router-link :to='"/subjects/" + item.title'>
                                <img class="w-100" :src='require(`../../subjects/sections/${item.section}/${item.title}.jpeg`)' alt="">
                            </router-link>
                            <h6 class="w-fit mx-auto">{{item.title}}</h6>
                            <hr>
                        </div>
                    </b-card>
                </b-col>
            </b-row>
        </b-container>
    </div>
</template>

<script>
export default {
      head(){
        return{
            title: `5 لصحتك | ${this.subject.title}`
        }
    },
    computed:{
        subject(){
            return this.$store.getters.kids[0]
        },
        all_subjects(){
            return this.$store.getters.all_subjects
        }
    }
}
</script>
