<template>
    <div class="blog mt-4 mb-3">
        <b-container>
            <b-row style="direction: rtl" class="text-right">
                <b-col lg="9" class="border">
                    <h1 class="title text-center text-color1">{{subject.title}}</h1>
                    <div class="info">
                        <div class="source">المصدر: {{subject.source}}</div>
                        <div class="date">
                            تم النشر يوم: {{subject.date}}
                        </div>
                    </div>
                    <div class="my-2 mx-auto">
                        <img class="d-block mx-auto w-50" :src="require(`../../subjects/sections/${subject.section}/${subject.title}.jpeg`)" alt="post-image">
                    </div>
                    <div class="content">
                        <h3>محتويات الصفحة</h3>
                        <ul class="list-group list_content list-unstyled">
                            <div class="row w-100">
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#hair2_intro">مقدمة</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#hair2_1">الفرق بين الشعر المجعد القصير والطويل</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#hair2_2">منتجات تصميم الشعر</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#hair2_3">العناية اليومية في الشعر المجعد : لماذا؟</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#hair2_4">تمشيط الشعر بالفرشاة</a></li>
                                </div>
                            </div>
                        </ul>
                        <p id="hair2_intro">
                            {{subject.head}}
                        </p>
                        
                        <h3 id="hair2_1">الفرق بين الشعر المجعد القصير والطويل </h3>
                        <p>
                            عندما يتعلق الأمر بالشعر القصير فمصمم الشعر الجيد يأخذ بالحسبان الأطوال واتجاهات القص، لأن أي تغيير يجرى بالشعر القصير، سيكون ملزما جدا ومحدد للغاية من حيث النتيجة التي نحصل عليها في الشعر. بالمقابل عندما يتعلق الأمر بالشعر الطويل، فيمكن أن نكون أكثر تجريدا من حيث التفكير وتكوين تركيز وقفزات في الشعر على كل طوله (مرة أخرى، من المهم جدا الأخذ بالحسبان نسيج الشعرة ومبنى الوجه).
                        </p>


                        <h3 id="hair2_2">منتجات تصميم الشعر</h3>
                        <p>
                            تصفيف الشعر المجعد يتم عادة بمساعدة منتجات الشعر التي تسمح لنا بتكوين نسيج والتركيز على حركة الشعر بشكل طبيعي. المنتج يجب أن يندمج مع الشعر وألا يكون "ضده" من حيث النتيجة التي يعطيها للمظهر النهائي. لا ينبغي للمنتج أن "يجبر" الشعر على التصرف بطريقة معينة لأن النتيجة عندها ستصمد لفترة قصيرة. الهدف هو اختيار منتج بجودة عالية وملائم من حيث المكونات التي فيه للحصول بالفعل على نتيجة التصميم المثالي لنوع الشعر المحدد. أنا أوصي دائما باختيار منتجات عناية بالشعر التي تعتمد على الرطوبة والتي تسمح بإدخال كمية كافية من المعادن والمواد البراقة الى الشعر من أجل تعزيز النتيجة.

                            منتج كهذا يعتمد فقط على الرطوبة بدون مواد لاصقة. الهدف من ذلك هو استخدام المنتجات التي تعمل على تحسين مظهر وملمس الشعر دون الحاجة إلى تغيير اتجاه نموه الطبيعي. الشعر المجعد يعتبر أحيانا متمرد وصعب الترتيب وبالتالي فمن المهم اختيار المنتج المناسب وفقا لنوع قصة الشعر والمظهر المطلوب في النتيجة النهائية.
                        </p>
                        <h3 id="hair2_3">العناية اليومية في الشعر المجعد : لماذا؟</h3>
                        <p>
                            لأننا نريد الحفاظ على تجعيد الشعر لدينا، فنحن بحاجة إلى الاستثمار فيه. ليس كثيرا، القليل كل يوم. الشعر المجعد يتطلب عناية خاصة كل يوم تقريبا من حيث عمليات المعالجة والرعاية المطلوبة من قبل العملاء في المنزل. الاختيار السليم للشامبو المناسب لنوع الشعر (يتم اختياره وفقا لوضع ونوع الشعر)، القناع للعلاج العميق والعناية بمظهر الشعر ومنتج مكمل لتكوين غلاف خارجي كامل.
                        </p>
                        <h3 id="hair2_4">تمشيط الشعر بالفرشاة</h3>
                        <p>
                            بانتظام. تمشيط الشعر فقط بعد وضع علاج القناع (ليس عندما يكون الشعر جاف) يعطيه حيوية ومرونة التي تبقى لفترة طويلة. أؤكد مرة أخرى انه من المهم اختيار المنتجات التي تحتوي على مكونات الترطيب والمواد المغذية وبذلك نحصل على علاج في مجالين رئيسيين:
                            <ol>
                                <li>علاج نسيج الشعر</li>
                                <li>علاج جفاف الشعر (خاصة الذي يظهر في أطراف الشعر).</li>
                            </ol>
                        </p>
                        <p>
                            مطري الشعر على أنواعه يكون مناسبا للاستخدام اليومي بالأساس لذوات الشعر الأرق، ولكن مطري الشعر يمكنه أن يعالج الشعر الطويل والأطراف، ولكن ليس في منطقة جذور الشعر. وظيفته الرئيسية هي فتح العقد وإعادة التوازن للشعر بعد عملية غسله بالشامبو. بالإضافة الى ذلك فالمطري الجيد والمهني يعطي شعورا لطيفا وناعما للشعر ويخلق شعورا لطيفا للملمس ولكنه لا يعتبر منتج علاجي بالمقارنة مع القناع العلاجي وكل ما يمنحه للشعر بعد اجراء العلاج.
                        </p>
                        <p>
                             حقن (ampulla) المصممة للعناية المكثفة بالشعر المجعد والتي تناسب بشكل خاص للاستخدام أيضا بعد صبغ الشعر أو استخدام الألوان العصرية. الغرض من استخدام هذه الحقن للعلاج هو تعميق علاج الشعر. قدرة الامتصاص لمكونات الأمبولة مرتفعة بشكل خاص ويمكن أن نلحظ تأثيرا ممتازا عندما يجرى العلاج على الشعر المتضرر أو المتقصف.
                        </p>
                    </div>
                </b-col>
                <b-col lg="3">
                    <b-card class="mt-1 mb-5 text-center" title="" header="مواضيع ذات صلة">
                        <div v-for="item in this.$store.getters.hair_care" :key="item.id">
                            <router-link :to='"/subjects/" + item.title'>
                                <img class="w-100" :src="require(`../../subjects/sections/${item.section}/${item.title}.jpeg`)" alt="">
                            </router-link>
                            <h6 class="w-fit mx-auto">{{item.title}}</h6>
                            <hr>
                        </div>
                    </b-card>
                </b-col>
            </b-row>
        </b-container>
    </div>
</template>

<script>
export default {
      head(){
        return{
            title: `5 لصحتك | ${this.subject.title}`
        }
    },
    computed:{
      head(){
        return{
            title: `5 لصحتك | ${this.subject.title}`
        }
    },
        subject(){
            return this.$store.getters.hair_care[1]
        },
        all_subjects(){
            return this.$store.getters.all_subjects
        }
    }
}
</script>

<style src="./style.scss" lang="scss" />

