<template>
    <div class="blog mt-4 mb-3">
        <b-container>
            <b-row style="direction: rtl" class="text-right">
                <b-col lg="9" class="border">
                    <h1 class="title text-center text-color1">{{subject.title}}</h1>
                    <div class="info">
                        <div class="source">المصدر: {{subject.source}}</div>
                        <div class="date">
                            تم النشر يوم: {{subject.date}}
                        </div>
                    </div>
                    <div class="my-2 mx-auto w-fit">
                        <img :src="require(`../../subjects/sections/${subject.section}/${subject.title}.jpeg`)" alt="post-image">
                    </div>
                    <div class="content">
                        <h5>محتويات الصفحة</h5>
                        <ul class="list-group mb-2 list_content">
                            <div class="row w-100">
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#oily-skin_1">مقدمة</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#oily-skin_2">علاج البشرة الدهنية</a></li>
                                </div>
                                <div class="col-md-6 list-group-item">
                                    <li class=""><a class="text-dark" href="#oily-skin_3">العلاجات المنزلية للبشرة الدهنية</a></li>
                                </div>
                            </div>
                        </ul>
                        
                        <h5 id="oily-skin_1">مقدمة </h5>
                        <div>{{subject.head}}</div>
                        <h5 id="oily-skin_2">علاج البشرة الدهنية</h5>
                        <p>فيما يأتي بعض العلاجات للبشرة الدهنية، ومنها:</p>
                        <ol>
                            <li class="mb-2">
                                <b>منظفات الوجه: </b>
                                 فتنظيف وتطهير الوجه من الطرق الفعالة في علاج البشرة الدهنية، ويُنظف الوجه به مرة في الصباح ومرة في الليل، باستخدام منظف لطيف؛ لأن الصابون القاسي يثير البشرة ويزيد من إنتاج الدهون، وفي حال عدم تقليل المنظف من الدهون يمكن تجربة منتجات أخرى مثل بنزويل البيروكسيد، أو حمض الساليسيليك، أو حمض الجليكوليك، أو حمض بيتا هيدروكسي، وتندرج هذه المنتجات تحت تسويق منتجات العناية بالوجه المصاب بحب الشباب لكنها جيدة لمشكلة البشرة الدهنية مع الأخذ بعين الاعتبار تجربة عدة منتجات؛ لإيجاد المنتج الأفضل والمناسب الذي لا يسبب التهيج للبشرة، بالإضافة إلى غسل البشرة بالماء الدافئ، وعدم غسله بالماء الساخن؛ لأنه يسبب تهيجاً للبشرة كذلك.
                            </li>
                            <li class="mb-2">
                                <b>التونر: </b>
                                حيث تنقسم الآراء حول استخدام التونر للبشرة الدهنية وإمكانيته في التقليل من الدهون، فالتونر القابض يمكنه تهييج البشرة، وبالتالي زيادة إنتاج الدهون، ويرى البعض الأخر أن التونر يجب استخدامه على المناطق الدهنية في البشرة مثل الجبين، والأنف، والذقن، وتجنب استخدامه على المناطق الجافة. ويمكن شراء التونر المخصص للبشرة الدهنية على ألّا يحتوي على العطور؛ لأنها تسبب تهيج البشرة، أو صنع تونر منزلي مثل خلط كميات متساوية من زيت شجرة الشاي والماء، ووضع الخليط على الوجه باستخدام زجاجة رذاذ أو قطعة من القطن، وهو تونر مناسب للبشرة الدهنية التي تعاني من العيوب، وحب الشباب.
                            </li>
                            <li class="mb-2">
                                <b>الوسائد الطبية: </b>
                                فالوسائد الطبية (بالإنجليزية: Medicated Pads) التي تحتوي على مكوناتٍ تُقلل من الدهون، أو التي تحتوي على حمض الساليسيليك، أو حمض الجليكوليك خيارٌ آخر لروتين الجمال، ويمكن استخدامها لانتعاش البشرة، وإزالة الدهون الزائدة.
                            </li>
                            <li class="mb-2">
                                <b>ورق النشاف التجميلي: </b>
                                فأوراق النشاف التجميلية (بالإنجليزية: Cosmetic blotting papers) يمكنها إزالة الدهون دون أن تسبب الجفاف للبشرة، وتتميز بسهولة استخدامها بوضعها على المناطق الدهنية في البشرة والضغط على الورقة دون فركها فترة تتراوح بين 15-20 ثانية، بحيث تمتص الورقة الدهون، كما أن بعض أوراق النشاف تحتوي على بوردة بشكلٍ خفيف تخفف من لمعان البشرة الدهنية.
                            </li>
                            <li class="mb-2">
                                <b>الأقنعة والطين: </b>
                                فالأقنعة والطين تسحب الدهون وتنظف المسام لكن يجب وضعها على المناطق الدهنية في البشرة فقط، وعدم الإكثار من استخدامها وتركها للمناسبات؛ لأنها تسبب الجفاف للبشرة.
                            </li>
                            <li class="mb-2">
                                <b>المرطبات: </b>
                                فالبشرة الدهنية تحتاج إلى الترطيب بخلاف ما يعتقده البعض لكنها تحتاج إلى المرطب الخالي من الزيوت، وتعتمد كمية المرطب المستخدمة على ميل المنطقة في البشرة لأي نوع الجافة أو الدهنية من أنواع البشرة
                            </li>
                            <li class="mb-2">
                                <b>واقي الشمس: </b>
                                إذ يُشكل واقي الشمس التقليدي مشكلة للبشرة الدهنية؛ لأنه يسبب إغلاق المسام، لكن يمكن استخدام جل واقي الشمس، أو واقي الشمس الخالي من الزيوت، أو بودرة الوجه؛ لحماية البشرة من الأشعة فوق البنفسجية، وهذه المنتجات لا تعطي البشرة المظهر الدهني كما يعطيه الكريم أو اللوشن الواقي من الشمس.
                            </li>
                            <li class="mb-2">
                                <b>المكياج: </b>
                                حيث يجب عدم وضع المكياج، أو تغيير المكياج إلى النوع الخالي من الزيوت؛ لأن المكياج الذي يحتوي على الزيوت يزيد من كمية الدهون على الوجه.
                            </li>
                            <li class="mb-2">
                                <b>التكيف مع روتين العناية بالوجه: </b>
                                إذ يختلف نوع البشرة من موسمٍ لآخر، ومن أسبوعٍ لآخر، ومن يومٍ لآخر؛ لأن إنتاج الدهون يتأثر بالهرمونات، وبالمزاج، وبالطقس، فبعض الأشخاص لديهم مشكلة البشرة الدهنية في فصل الصيف فقط، لذلك من الضروري ضبط روتين العناية بالوجه وفقاً لذلك، بحيث يمكن أن تتطلب البشرة استخدام منظف يحتوي على حمض الجليكوليك يومياً خلال الصيف، واستخدامه بين الحين والآخر خلال فصل الشتاء، بالإضافة إلى أن الإفراط باستخدام منتجات البشرة الدهنية يمكنه أن يسبب الجفاف للبشرة. ومن الجدير بالذكر أن إنتاج الدهون في البشرة أمر طبيعي في البشرة الصحية، كما أن البشرة الدهنية تميل إلى ظهور تجاعيد أقل، ومظهر صحي أكثر للبشرة، لذلك يجب عدم الإفراط في محاولة إزالة الدهون الزائدة، والحذر حتى لا يصل الأمر إلى حرمان البشرة من الآلية الطبيعية (دهون البشرة) التي تكاف
                            </li>
                            <li class="mb-2">
                                <b>الغذاء: </b>
                                حيث يؤثر الغذاء على البشرة، ويمكنه أن يجعلها دهنية أو يؤدي إلى مشاكل أخرى مثل حب الشباب، والمسام الواسعة، والرؤوس البيضاء، والرؤوس السوداء، ويمكن عمل بعض التغييرات في النظام الغذائي لعلاج البشرة الدهنية والسيطرة على إفراز الدهون في الغدد الدهنية عن طريق تناول الأطعمة المفيدة للبشرة مثل: الخيار، والحبوب الكاملة، والعدس، والحبوب، والبرتقال، وعصير الليمون، وماء جوز الهند، والشكولاتة الداكنة، والأفوكادو، والسبانخ، والمكسرات، والموز. وتجنب تناول الأطعمة الدسمة التي تحتوي على الدهون المشبعة، ومنتجات الألبان، والكافيين، والخبز الأبيض أو المعكرونة البيضاء (كربوهيدرات مكررة)، والسكريات، والمشروبات الغازية، والوجبات الخفيفة المالحة مثل: رقائق البطاطا، والمكسرات المملحة، بالإضافة إلى تجنب اللحوم الدهنية، والكحول، والأطعمة الحارة والاستعاضة عنها بالسلطات والشوربات.
                            </li>
                            <li class="mb-2">
                                <b>الليزر والتقشير الكيميائي: </b>
                                إذ يمكن استشارة طبيب الجلدية عند فشل المنتجات التي تكون دون الوصفة الطبية في علاج البشرة الدهنية حول الليزر والتقشير الكيميائي؛ للتقليل من الدهون، وتحسين مظهر البشرة بشكلٍ عام، كما أن الكريمات التي تحتوي على التريتينوين، أو أدابالين، أو تازاروتين يمكنها تعديل المسام والتقليل من الدهون، وتستخدم على المناطق الدهنية فقط حسب الحاجة؛ لأنها تسبب التهيج للبشرة.
                            </li>
                        </ol>
                        <h5 id="oily-skin_3">العلاجات المنزلية للبشرة الدهنية</h5>
                        <div>
                            يمكن تجربة بعض العلاجات المنزلية في علاج البشرة الدهنية والتي تخفف من الأعراض دون اللّجوء إلى العلاجات المكلفة أو الوصفات الطبية، ومنها:
                            <ul>
                                <ol>
                                    <li>
                                      <b>  العسل:</b> 
                                        <p>
                                            حيث يحتوي العسل على خصائص مضادة للبكتيريا ومطهّرة، ويعتبر من المطريات التي ترطّب البشرة بحيث تسحب الترطيب من البشرة نفسها ولا تتركها دهنية، ويمكن الاستفادة منه للبشرة الدهنية والبشرة المعرضة لحب الشباب، والطريقة هي:
                                        </p>
                                        <ul>
                                            <li class="text-bold"><b>المكونات: </b>عسل نحل(يفضل عسل نحل خام)</li>
                                            <li><b>طريقة التحضير: </b>
                                                <ul>
                                                    <li>توزيع طبقة رقيقة من العسل على الوجه.</li>
                                                    <li>ترك العسل على الوجه حوالي 10 دقائق</li>
                                                    <li>شطف الوجه بالماء الدافئ.</li>
                                                </ul>
                                            </li>
                                        </ul>
                                    </li>
                                    <li>
                                        <b>بياض البيض والليمون: </b>
                                        <p>وهذه الوصفة تشد المسام وتمتص الدهون من البشرة، وتحتوي على قدرات مضادة للبكتيريا نظراً لوجود الليمون فيها، والطريقة هي:</p>
                                        <ul>
                                            <li><b>المكونات: </b>
                                                <ul>
                                                    <li>بياض بيضة واحدة</li>
                                                    <li>ملعقة صغيرة من عصير الليمون الطازج</li>
                                                </ul>
                                            </li>
                                            <li><b>طريقة التحضير: </b>
                                                <ul>
                                                    <li>خلط بياض البيض وعصير الليمون.</li>
                                                    <li>وضع الخليط على الوجه</li>
                                                    <li>ترك القناع على الوجه حتى يجف</li>
                                                    <li>غسل الوجه بالماء الدافئ، وتجفيفه بالطبطبة</li>
                                                </ul>
                                            </li>
                                        </ul>
                                        <p><b>ملاحظة:</b> يجب عدم استخدام هذه الوصفة للأشخاص الذين لديهم حساسية من البيض.</p>
                                    </li>
                                    <li>
                                    <b>الألوفيرا: </b>
                                        إذ تستخدم الألوفيرا (جل الصبار) في علاج البشرة الدهنية والبشرة المتقشرة التي تسببها البقع الدهنية، والطريقة هي:
                                        <ul>

                                            <li>
                                                <b>المكونات: </b>
                                                <ul>
                                                    <li>جل الألوفيرا</li>
                                                </ul>
                                            </li>
                                            <li><b>طريقة التحضير: </b>
                                                <ul>
                                                    <li>وضع طبقة رقيقة من جل الألوفيرا على الوجه قبل النوم.</li>
                                                    <li>ترك الجل على الوجه طوال الليل.</li>
                                                </ul>
                                            </li>
                                        </ul>
                                        <p><b>ملاحظة: </b>يسبب جل الألوفيرا رد فعل تحسسي على البشرة الحساسة.</p>
                                    </li>
                                </ol>
                            </ul>
                        </div>
                    </div>
                </b-col>
                <b-col lg="3">
                    <b-card class="mt-1 mb-5 text-center" title="" header="مواضيع ذات صلة">
                        <div v-for="item in this.$store.getters.skin_care" :key="item.id">
                            <router-link :to='"/subjects/" + item.title'>
                                <img class="w-100" :src='require(`../../subjects/sections/${item.section}/${item.title}.jpeg`)' alt="">
                            </router-link>
                            <h6 class="w-fit mx-auto">{{item.title}}</h6>
                            <hr>
                        </div>
                    </b-card>
                </b-col>
            </b-row>
        </b-container>
    </div>
</template>

<script>
export default {
      head(){
        return{
            title: `5 لصحتك | ${this.subject.title}`
        }
    },
    computed:{
        subject(){
            return this.$store.getters.skin_care[0]
        },
        all_subjects(){
            return this.$store.getters.all_subjects
        }
    }
}
</script>

<style lang='scss'>
.text-bold{font-size: bold !important}
.blog{

    .container{

        .row{

            h5{
                width: fit-content;
                padding: 5px 10px;
            }

            .content{

                
                .list_content{

                

                    .list-group-item{
                        transition: 0.3s;

                        &:hover a{
                            background-color: var(--primary-color);
                            color: #fff !important;
                        }

                        li{


                            a{
                                text-decoration: none;
                                display: block;
                                transition: 0.3s;
                            }
                        }
                    }
                }
            }

            .card{
                
                h6{
                    transition: 0.3s;
                    position: relative;
                    padding: 5px 10px;
                }
                a{
                    display: block;
                    overflow: hidden;


                    img{
                        transition: 0.3s;

                        &:hover{
                            transform: scale(1.5);
                            filter: blur(3px) grayscale(0.5);
                        }

                    }

                    &:hover + h6{
                        color: #fff;
                        background-color: rgba(1,1,1,0.5);
                        top: -30px;
                    }
                }
            }
        }
    }
}
</style>

